se corrige navbar
